import React, { useEffect } from 'react';
import Header from '../components/Header/Header.jsx';
import Title from '../components/Title/Title.jsx';
import Footer from '../components/Footer/Footer.jsx';
import TechType from '../components/TechType/TechType.jsx';
import photo from '../images/techMain-photo.jpg';
import mainDrone from '../images/type-drone.jpg';
import mainAer from '../images/type-aer.jpg';
import mainTech from '../images/type-tech.jpg';
import drone1 from '../images/drone-1.jpg';
import drone2 from '../images/drone-2.jpg';
import drone3 from '../images/drone-3.jpg';
import plane1 from '../images/plane-1.jpg';
import plane2 from '../images/plane-2.jpg';
import plane3 from '../images/plane-3.jpg';
import tech1 from '../images/tech-1.jpg';
import tech2 from '../images/tech-2.jpg';
import tech3 from '../images/tech-3.jpg';

const data = [{
  type: 'БЕЗПІЛОТНИКИ',
  images: [drone1, drone2, drone3],
  texts: ["PD-2 (акр. від англ. People's Drone — «народний дрон») — український багатоцільовий БпЛА виробництва Ukrspecsystems. Призначений для здійснення повітряної розвідки та бойового застосування як носій бомбового навантаження з бойовою частиною вагою до 3 кг[3]. Може злітати зі злітної смуги («по-літаковому»), також може оснащуватися модулями системи вертикального зльоту та посадки, що робить його апаратом вертикального злету та приземлення (англ. VTOL — Vertical Take-Off and Landing).", "Дрон-камікадзе (англ. kamikaze drone) — це тип безпілотних літальних апаратів з інтегрованою бойовою частиною, які здатні тривалий час в режимі очікування знаходитися в повітрі в районі цілі та оперативно атакувати її після отримання відповідної команди від оператора, або виконувати завдання, передбачені закладеним алгоритмом.", "SHARK (укр. «ШАРК») — розвідувальний безпілотний комплекс, створений компанією Ukrspecsystems для спостереження та коригування вогню. Безпілотний літальний апарат (БпЛА) обладнано високонадійним модулем зв’язку (шифрування AES256), що дозволяє йому заглибитися у тил противника до 80 км в умовах радіоелектронної боротьби (РЕБ). Оптико-електронний комплекс спостереження з роздільною здатністю Full HD, з 30-кратним оптичним збільшенням і додатковим 3х цифровим зумом[en] дає змогу вести спостереження на відстані до 5 км від безпілотника до об'єкта."]
},{
  type: 'АВІАЦІЯ',
  images: [plane1, plane2, plane3],
  texts: ["МіГ-29 ( кодове ім'я НАТО: Fulcrum) — багатоцільовий радянський винищувач четвертого покоління. Був основним багатоцільовим винищувачем країн Варшавського договору та СРСР впродовж 80-х років XX ст. Нині перебуває на озброєнні багатьох країн світу, зокрема й України.", "Су-24 (за класифікацією НАТО — Fencer) — радянський надзвуковий фронтовий бомбардувальник з крилом змінної стрілоподібності. Розробка почалася на початку 1960-х, у 1972 році був прийнятий на озброєння ВПС СРСР. Випущено близько 1200 літаків в різних модифікаціях. Призначений для завдання ракетно-бомбових ударів у простих та складних метеоумовах, вдень та вночі, зокрема на малих висотах з прицільним враженням наземних і надводних цілей. Носій тактичних ядерних зарядів. Су-24М — основний літак бомбардувальної авіації Повітряних сил України.", "Ан-30 (з кодифікації НАТО: Clank; — «Брязкіт») — літак повітряного спостереження та аерофотозйомки. Розроблений в АНТК імені Олега Антонова спільно з ДКБ Берієва. Ан-30 є модифікацією літака Ан-24 і призначений для аерофотознімальних і аерогеофізичних робіт. Як і попередні — Ан-24 і Ан-26 — машина мала в народі прізвисько «Настя» («Настенька»)."]
},{
  type: 'ВАЖКА ТЕХНІКА',
  images: [tech1, tech2, tech3],
  texts: ["Кевлар-Е — український проєкт бойової машини піхоти на базі шасі від 2С1 «Гвоздика». Розробник — компанія Укріннмаш. На цьому БМП замість 122-мм гармати зроблена надбудова для збільшення висоти десантного відділення та встановлений бойовий модуль «Штурм» з 30-мм автоматичною гарматою.", "БТР-60М «Хорунжий» — бронетранспортер від НВО «Практика», глибока модернізація БТР-60ПБ.Завдяки новій формі та більшій висоті корпусу має просторіше, ергономічне десантне відділення, має підвищений балістичний захист, протимінний захист (забезпечується багатошаровою підлогою і спеціальними протиударними сидіннями), кондиціонер, сучасний дизельний двигун Deutz (замість двох бензинових ГАЗ-49Б), автоматична коробка передач, система пожежогасіння, сучасні прилади спостереження ", "БМ-7 «Парус» — український дистанційно керований бойовий модуль, що встановлюється на легких бойових броньованих машинах (БТР, БМП тощо). «Парус» за характеристиками схожий на «Штурм», основна конструктивна відмінність полягає в тому, що «Парус» не займає місця всередині корпусу базової машини"]
}];


const TechPage = () => {
  useEffect(() => {
    const observer = new IntersectionObserver((entries) => {
      entries.forEach((entry) => {
        if (entry.isIntersecting) {
          entry.target.classList.add("show");
        } else {
          entry.target.classList.remove("show");
        }
      });
    });

    const hiddenElements = document.querySelectorAll(".hidden");
    hiddenElements.forEach((el) => observer.observe(el));
  }, [])
  
  return (
    <>
      <Header/>
      <Title photo={photo} isHome={false}/>
      <h1 className='type__title hidden'>ТЕХНІКА</h1>
      <TechType photo={mainDrone} type='БЕЗПІЛОТНИКИ' data={data[0]}/>
      <TechType photo={mainAer} type='АВІАЦІЯ' data={data[1]}/>
      <TechType photo={mainTech} type='ВАЖКА ТЕХНІКА' data={data[2]}/>
      <Footer isHome={false}/>
    </>
  )
};

export default TechPage
